app/Http/Controllers/Auth/RegisterController.php

select count(*) as aggregate from `enseignant` where `unique_id` = '2588555'
---
    protected function create(array $data)
    {

        $id= $data['unique_id'];
/* dd($id); */
       // $p= Enseignant::findOrFail($id);

        $d = DB::table('enseignant')
       ->select('unique_id as id' )
       ->where('unique_id','=',$id)
       ->count();