app/Http/Controllers/compteEnseignantController.php

select distinct `matiere`.`codemat`, `matiere`.`libmat` from `matiere`
---
  public function create()
  {
    $user = auth()->user();

    $uid=$user->unique_id;



    $data = DB::table('etab')
    ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
    ->join('delegation', 'delegation.code', '=', 'etab.delegation')
    ->select('etab.codeetab as id','etab.libetab' )
    ->get();


    $data2 = DB::table('matiere')

    ->select('matiere.codemat','matiere.libmat')->distinct()

    ->get();


    $data3 = DB::table('grade_ens')

    ->select('codegrade','libgrade')

    ->get();