app/Http/Controllers/compteEnseignantController.php

select distinct `enseignant`.`nom`, `enseignant`.`nom_fr`, `enseignant`.`telephone`, `enseignant`.`situation_f`, `enseignant`.`nbr_enf`, `enseignant`.`sexe`, `enseignant`.`sec_s`, `enseignant`.`lieu_n`, `enseignant`.`date_n`, `enseignant`.`adresse`, `grade_ens`.`libgrade`, `enseignant`.`prenom`, `enseignant`.`prenom_fr`, `enseignant`.`nbr_enf`, `matiere`.`libmat`, `matiere`.`codemat` from `enseignant` left join `grade_ens` on `grade_ens`.`codegrade` = `enseignant`.`designation_grade` left join `matiere` on `matiere`.`codemat` = `enseignant`.`matiere` where `enseignant`.`unique_id` = 4747474747
---
  public function c()
  {
    $user = auth()->user();

    $uid=$user->unique_id;

    $data = Enseignant::leftJoin('grade_ens', 'grade_ens.codegrade', '=', 'enseignant.designation_grade')
    ->leftJoin('matiere', 'matiere.codemat', '=', 'enseignant.matiere')
    ->select( 'enseignant.nom','enseignant.nom_fr','enseignant.telephone','enseignant.situation_f','enseignant.nbr_enf','enseignant.sexe','enseignant.sec_s','enseignant.lieu_n','enseignant.date_n','enseignant.adresse', 'grade_ens.libgrade','enseignant.prenom','enseignant.prenom_fr','enseignant.nbr_enf','matiere.libmat','matiere.codemat' )
->distinct()
->where('enseignant.unique_id','=',$uid)
->get();

select `etab`.`codeetab` as `id`, `etab`.`libetab` from `etab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation`
select distinct `matiere`.`codemat`, `matiere`.`libmat` from `matiere`
select distinct `enseignant`.`nom`, `grade_ens`.`libgrade`, `enseignant`.`prenom`, `enseignant`.`nbr_enf`, `matiere`.`libmat`, `matiere`.`codemat` from `enseignant` left join `grade_ens` on `grade_ens`.`codegrade` = `enseignant`.`designation_grade` left join `matiere` on `matiere`.`codemat` = `enseignant`.`matiere` where `enseignant`.`unique_id` = 4747474747
---
  public function create()
  { $user = auth()->user();

    $uid=$user->unique_id;



    $data = DB::table('etab')
    ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
    ->join('delegation', 'delegation.code', '=', 'etab.delegation')
    ->select('etab.codeetab as id','etab.libetab' )
    ->get();


    $data2 = DB::table('matiere')

    ->select('matiere.codemat','matiere.libmat')->distinct()

    ->get();


    $data3 = DB::table('grade_ens')

    ->select('codegrade','libgrade')

    ->get();

    $data4 = Enseignant::leftJoin('grade_ens', 'grade_ens.codegrade', '=', 'enseignant.designation_grade')
    ->leftJoin('matiere', 'matiere.codemat', '=', 'enseignant.matiere')
->select( 'enseignant.nom', 'grade_ens.libgrade','enseignant.prenom','enseignant.nbr_enf','matiere.libmat','matiere.codemat' )
->distinct()
->where('enseignant.unique_id','=',$uid)
->get();

select `etab`.`codeetab` as `id`, `etab`.`libetab` from `etab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation`
select distinct `matiere`.`codemat`, `matiere`.`libmat` from `matiere`
select distinct `enseignant`.`nom`, `grade_ens`.`libgrade`, `enseignant`.`prenom`, `enseignant`.`nbr_enf`, `matiere`.`libmat`, `matiere`.`codemat` from `enseignant` left join `grade_ens` on `grade_ens`.`codegrade` = `enseignant`.`designation_grade` left join `matiere` on `matiere`.`codemat` = `enseignant`.`matiere` where `enseignant`.`unique_id` = 4747474747
---
public function create2()
{
  $user = auth()->user();

    $uid=$user->unique_id;

  $data = DB::table('etab')
  ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
  ->join('delegation', 'delegation.code', '=', 'etab.delegation')

  ->select('etab.codeetab as id','etab.libetab' )

  ->get();


  $data2 = DB::table('matiere')

  ->select('matiere.codemat','matiere.libmat')->distinct()

  ->get();


  $data3 = DB::table('grade_ens')

  ->select('codegrade','libgrade')

  ->get();


    $data4 = Enseignant::leftJoin('grade_ens', 'grade_ens.codegrade', '=', 'enseignant.designation_grade')
    ->leftJoin('matiere', 'matiere.codemat', '=', 'enseignant.matiere')
->select( 'enseignant.nom', 'grade_ens.libgrade','enseignant.prenom','enseignant.nbr_enf','matiere.libmat','matiere.codemat' )
->distinct()
->where('enseignant.unique_id','=',$uid)
->get();

select distinct `posteetab`.`idetab`, `etab`.`libetab`, `posteetab`.`nbrpost` from `posteetab` inner join `etab` on `etab`.`codeetab` = `posteetab`.`idetab` inner join `matiere` on `matiere`.`codemat` = `posteetab`.`codemat` where `posteetab`.`codemat` = '112' and `posteetab`.`nbrpost` > 0
---
    public function getetab(Request $request){

      if(Request()->ajax()) {
        $id = $request->all();
    }
    $gg=$id['ccod'];

$c=0;
    $data = DB::table('posteetab')
    ->join('etab', 'etab.codeetab', '=', 'posteetab.idetab')
    ->join('matiere', 'matiere.codemat', '=', 'posteetab.codemat')

    ->where('posteetab.codemat','=',$gg)
    ->where('posteetab.nbrpost','>',0)
    ->select('posteetab.idetab','etab.libetab','posteetab.nbrpost')->distinct()
    ->get();

select `posteetab`.`nbrpost`, `posteetab`.`codemat`, `posteetab`.`idetab` from `posteetab` inner join `etab` on `etab`.`codeetab` = `posteetab`.`idetab` inner join `matiere` on `matiere`.`codemat` = `posteetab`.`codemat` where `posteetab`.`idetab` = '912501' and `posteetab`.`codemat` = '104'
insert into `posteetab` (`idetab`, `codemat`, `nbrpost`, `updated_at`, `created_at`) values ('912501', '104', '216.5', '2020-09-23 12:34:09', '2020-09-23 12:34:09')
---
  public function insertpost(Request $request)
    {
      if(Request()->ajax()) {
        $id = $request->all();
    }
    $nbr=$id['nbrposte'];
    $idetab =$id['idetab'];
    $codemat = $id['codemat'];



    $data = DB::table('posteetab')
    ->join('etab', 'etab.codeetab', '=', 'posteetab.idetab')
    ->join('matiere', 'matiere.codemat', '=', 'posteetab.codemat')
    ->where('posteetab.idetab','=',$idetab )
    ->where('posteetab.codemat','=',$codemat)
    ->select('posteetab.nbrpost', 'posteetab.codemat', 'posteetab.idetab')

    ->get();



       $add_product =new PosteEtab([
                              'idetab'=>$idetab,
                              'codemat'=>$codemat,
                              'nbrpost'=>$nbr,

                        ]);
                        $add_product ->save();

select distinct `enseignant`.`id`, `enseignant`.`unique_id`, `enseignant`.`nom`, `enseignant`.`nom_fr`, `enseignant`.`telephone`, `enseignant`.`situation_f`, `enseignant`.`nbr_enf`, `enseignant`.`sexe`, `enseignant`.`sec_s`, `enseignant`.`lieu_n`, `enseignant`.`date_n`, `enseignant`.`adresse`, `grade_ens`.`libgrade`, `enseignant`.`prenom`, `enseignant`.`prenom_fr`, `enseignant`.`nbr_enf`, `matiere`.`libmat`, `matiere`.`codemat` from `enseignant` left join `grade_ens` on `grade_ens`.`codegrade` = `enseignant`.`designation_grade` left join `matiere` on `matiere`.`codemat` = `enseignant`.`matiere` where `enseignant`.`unique_id` = 4747474747
---
public function seting(){
  $user = auth()->user();

  $uid=$user->unique_id;

  $data = Enseignant::leftJoin('grade_ens', 'grade_ens.codegrade', '=', 'enseignant.designation_grade')
  ->leftJoin('matiere', 'matiere.codemat', '=', 'enseignant.matiere')
  ->select( 'enseignant.id','enseignant.unique_id','enseignant.nom','enseignant.nom_fr','enseignant.telephone','enseignant.situation_f','enseignant.nbr_enf','enseignant.sexe','enseignant.sec_s','enseignant.lieu_n','enseignant.date_n','enseignant.adresse', 'grade_ens.libgrade','enseignant.prenom','enseignant.prenom_fr','enseignant.nbr_enf','matiere.libmat','matiere.codemat' )
  ->distinct()
  ->where('enseignant.unique_id','=',$uid)
  ->get();

select * from `users` where `unique_id` = 4747474747 limit 1
---
public function upd(Request $request, $id)
{
  $user = auth()->user();

  $uid=$user->unique_id;

  $user = User::where('unique_id', $uid)->firstOrFail();