app/Http/Controllers/EnseignantController.php

select distinct `mouvement_mariage`.`unique_id` as `id`, `mouvement_mariage`.`prenom`, `mouvement_mariage`.`copybid`, `mouvement_mariage`.`nom`, `mouvement_mariage`.`gradeact`, `mouvement_mariage`.`matiere`, `mouvement_mariage`.`etabact` from `scoremv` inner join `mouvement_mariage` on `mouvement_mariage`.`unique_id` = `scoremv`.`unique_id` order by `scoremv`.`score` desc
select distinct `mouvement`.`unique_id2` as `id`, `mouvement`.`prenom`, `mouvement`.`copybid`, `mouvement`.`nom`, `mouvement`.`gradeact`, `mouvement`.`matiere`, `mouvement`.`etabact` from `mouvement`
---
    public function indexuser()
    {


        $data = DB::table('scoremv')
       ->join('mouvement_mariage', 'mouvement_mariage.unique_id', '=', 'scoremv.unique_id')
      // ->join('matiere', 'matiere.codemat', '=', 'mouvement_mariage.matiere')

       ->select('mouvement_mariage.unique_id as id','mouvement_mariage.prenom','mouvement_mariage.copybid','mouvement_mariage.nom','mouvement_mariage.gradeact','mouvement_mariage.matiere','mouvement_mariage.etabact' )
       ->distinct()
       ->orderBy('scoremv.score','desc')
       ->get();


       $data2 = DB::table('mouvement')
      // ->join('mouvement_mariage', 'mouvement_mariage.unique_id', '=', 'scoremv.unique_id')
      // ->join('matiere', 'matiere.codemat', '=', 'mouvement_mariage.matiere')

       ->select('mouvement.unique_id2 as id','mouvement.prenom','mouvement.copybid','mouvement.nom','mouvement.gradeact','mouvement.matiere','mouvement.etabact' )
       ->distinct()
       ->get();

select distinct `enseignant`.`id`, `enseignant`.`unique_id`, `enseignant`.`sec_s`, `enseignant`.`nom`, `grade_ens`.`libgrade`, `enseignant`.`prenom`, `enseignant`.`email`, `enseignant`.`telephone`, `enseignant`.`sexe`, `matiere`.`libmat` from `enseignant` left join `grade_ens` on `grade_ens`.`codegrade` = `enseignant`.`designation_grade` left join `matiere` on `matiere`.`codemat` = `enseignant`.`matiere`
---
   public function index(){


    $data = Enseignant::leftJoin('grade_ens', 'grade_ens.codegrade', '=', 'enseignant.designation_grade')
    ->leftJoin('matiere', 'matiere.codemat', '=', 'enseignant.matiere')
->select('enseignant.id','enseignant.unique_id', 'enseignant.sec_s', 'enseignant.nom', 'grade_ens.libgrade','enseignant.prenom', 'enseignant.email', 'enseignant.telephone', 'enseignant.sexe','matiere.libmat' /*'grade.designation'*/)
->distinct()
->get();

select `libgrade`, `codegrade` from `grade_ens`
select distinct `libmat`, `codemat` from `matiere`
---
  public function create()
  {
    $data = DB::table('grade_ens')
    ->select ('libgrade','codegrade')
    ->get();


    $data2 = DB::table('matiere')
    ->select ('libmat','codemat')
    ->distinct()
    ->get();