app/Http/Controllers/HomeController.php

select distinct `enseignant`.`nom`, `enseignant`.`nom_fr`, `enseignant`.`telephone`, `enseignant`.`situation_f`, `enseignant`.`nbr_enf`, `enseignant`.`sexe`, `enseignant`.`sec_s`, `enseignant`.`lieu_n`, `enseignant`.`date_n`, `enseignant`.`adresse`, `grade_ens`.`libgrade`, `enseignant`.`prenom`, `enseignant`.`prenom_fr`, `enseignant`.`nbr_enf`, `matiere`.`libmat`, `matiere`.`codemat` from `enseignant` left join `grade_ens` on `grade_ens`.`codegrade` = `enseignant`.`designation_grade` left join `matiere` on `matiere`.`codemat` = `enseignant`.`matiere` where `enseignant`.`unique_id` = 4444444444
---
    public function index()
    {

    $user = auth()->user();

    $uid=$user->unique_id;

    $data = Enseignant::leftJoin('grade_ens', 'grade_ens.codegrade', '=', 'enseignant.designation_grade')
    ->leftJoin('matiere', 'matiere.codemat', '=', 'enseignant.matiere')
    ->select( 'enseignant.nom','enseignant.nom_fr','enseignant.telephone','enseignant.situation_f','enseignant.nbr_enf','enseignant.sexe','enseignant.sec_s','enseignant.lieu_n','enseignant.date_n','enseignant.adresse', 'grade_ens.libgrade','enseignant.prenom','enseignant.prenom_fr','enseignant.nbr_enf','matiere.libmat','matiere.codemat' )
    ->distinct()
    ->where('enseignant.unique_id','=',$uid)
    ->get();