app/Http/Controllers/LyceeController.php

select `etab`.`codeetab` as `id`, `etab`.`libetab` from `etab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation` where `etab`.`typeetab` = '10'
---
    public function index()
    {

        $data = DB::table('etab')
       ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
       ->join('delegation', 'delegation.code', '=', 'etab.delegation')

       ->select('etab.codeetab as id','etab.libetab' )
       ->where('etab.typeetab','=','10')
       ->get();

select `etab`.`codeetab` as `id`, `etab`.`libetab` from `etab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation`
select `section`.`codesection`, `section`.`libsection` from `section` where `section`.`codesection` >= '1'
---
    public function saisie(Request $request)
    {
        $idd=$request->get('nameetab');


        $data1 = DB::table('etab')
       ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
       ->join('delegation', 'delegation.code', '=', 'etab.delegation')

       ->select('etab.codeetab as id','etab.libetab' )
       //->where('etab.typeetab','=','10')
       ->get();



   //dd($idd);

       ////////////take theh name of the section//////
       $data2 = DB::table('section')

       ->where('section.codesection', '>=','1')


       ->select('section.codesection','section.libsection' )
       ->get();

select distinct `niveau`.`libniv`, `niveau`.`codeniv`, `etab`.`libetab`, `classe`.`nbclasse`, `matiere`.`libmat`, `matiere`.`nbh` from `classe` inner join `niveau` on `niveau`.`codeniv` = `classe`.`codeniv` inner join `matiere` on `matiere`.`codniv` = `niveau`.`codeniv` inner join `etab` on `etab`.`codeetab` = `classe`.`codetab` where `etab`.`codeetab` = '912501'
---
    public function getTable(Request $request){
        if(Request()->ajax()) {
            $id = $request->all();
        }
        $gg=$id['idetab'];
       // dd($gg);
    	// Fetch Users by Departmentid
        $data = DB::table('classe')->distinct()
        ->join('niveau', 'niveau.codeniv', '=', 'classe.codeniv')
        ->join('matiere', 'matiere.codniv', '=', 'niveau.codeniv')
        ->join('etab', 'etab.codeetab', '=', 'classe.codetab')
        ->where('etab.codeetab', '=', $gg)
        ->select('niveau.libniv','niveau.codeniv','etab.libetab','classe.nbclasse' ,'matiere.libmat','matiere.nbh')
        ->distinct()
        ->get( );

select distinct SUM(matiere.nbh*classe.nbclasse)as tot, `effectif`.`nb12`, `effectif`.`nb15`, `effectif`.`nb16`, `effectif`.`nb18`, `effectif`.`nb05`, `matiere`.`libmat`, `matiere`.`codemat`, `matiere`.`nbh`, `etab`.`codeetab` as `id`, `etab`.`libetab`, `classe`.`nbclasse` from `classe` inner join `niveau` on `niveau`.`codeniv` = `classe`.`codeniv` inner join `matiere` on `matiere`.`codniv` = `classe`.`codeniv` inner join `etab` on `etab`.`codeetab` = `classe`.`codetab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation` inner join `effectif` on `effectif`.`codeetab` = `etab`.`codeetab` and `effectif`.`codemat` = `matiere`.`codemat` where `matiere`.`codemat` = '124' and `etab`.`codeetab` = '915802'
---
    public function gettableb2(Request $request)
    {

        $data2 = DB::table('classe')
        ->join('niveau', 'niveau.codeniv', '=', 'classe.codeniv')
        ->join('matiere', 'matiere.codniv', '=', 'classe.codeniv')
        ->join('etab', 'etab.codeetab', '=', 'classe.codetab')
        ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
        ->join('delegation', 'delegation.code', '=', 'etab.delegation')
        ->join("effectif",function($join){
            $join->on("effectif.codeetab","=","etab.codeetab")
                ->on("effectif.codemat","=","matiere.codemat");
        })
        ->where('matiere.codemat','=',$request->get('codemat'))
        ->where('etab.codeetab','=',$request->get('ccod'))
       ->select(DB::raw("SUM(matiere.nbh*classe.nbclasse)as tot"),'effectif.nb12','effectif.nb15','effectif.nb16','effectif.nb18','effectif.nb05','matiere.libmat','matiere.codemat','matiere.nbh','etab.codeetab as id','etab.libetab','classe.nbclasse')

       ->distinct()



       ->get();

select distinct `matiere`.`libmat`, `matiere`.`codemat` from `matiere`
---
    public function gettableb3(Request $request)
    {

       $reql = DB::table('classe')

        ->join('matiere', 'matiere.codniv', '=', 'classe.codeniv')
        ->join('etab', 'etab.codeetab', '=', 'classe.codetab')

       ->select( 'etab.libetab','etab.codeetab')
       ->distinct()

      ->where('matiere.codemat','=',$request->get('ccod'))
       ->get();


                $data = DB::table('classe')
                ->join('niveau', 'niveau.codeniv', '=', 'classe.codeniv')
                ->join('matiere', 'matiere.codniv', '=', 'classe.codeniv')
                ->join('etab', 'etab.codeetab', '=', 'classe.codetab')
                ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
                ->join('delegation', 'delegation.code', '=', 'etab.delegation')
                ->join("effectif",function($join){
                    $join->on("effectif.codeetab","=","etab.codeetab")
                        ->on("effectif.codemat","=","matiere.codemat");
                })
                ->where('matiere.codemat','=',$request->get('ccod'))
               ->select('effectif.nb12','effectif.nb15','effectif.nb16','effectif.nb18','effectif.nb05','matiere.libmat','matiere.codemat','matiere.nbh','etab.codeetab as id','etab.libetab','classe.nbclasse')
               ->distinct()

               ->get();

select distinct SUM(matiere.nbh*classe.nbclasse)as tot, `effectif`.`nb12`, `effectif`.`nb15`, `effectif`.`nb16`, `effectif`.`nb18`, `effectif`.`nb05`, `matiere`.`libmat`, `matiere`.`codemat`, `matiere`.`nbh`, `etab`.`codeetab` as `id`, `etab`.`libetab`, `classe`.`nbclasse` from `classe` inner join `niveau` on `niveau`.`codeniv` = `classe`.`codeniv` inner join `matiere` on `matiere`.`codniv` = `classe`.`codeniv` inner join `etab` on `etab`.`codeetab` = `classe`.`codetab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation` inner join `effectif` on `effectif`.`codeetab` = `etab`.`codeetab` and `effectif`.`codemat` = `matiere`.`codemat` where `matiere`.`codemat` = '120' and `etab`.`codeetab` = '914508'
---
    public function gettableb4(Request $request)
    {

        $data2 = DB::table('classe')
        ->join('niveau', 'niveau.codeniv', '=', 'classe.codeniv')
        ->join('matiere', 'matiere.codniv', '=', 'classe.codeniv')
        ->join('etab', 'etab.codeetab', '=', 'classe.codetab')
        ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
        ->join('delegation', 'delegation.code', '=', 'etab.delegation')
        ->join("effectif",function($join){
            $join->on("effectif.codeetab","=","etab.codeetab")
                ->on("effectif.codemat","=","matiere.codemat");
        })
        ->where('matiere.codemat','=',$request->get('ccod'))
        ->where('etab.codeetab','=',$request->get('codeetab'))
       ->select(DB::raw("SUM(matiere.nbh*classe.nbclasse)as tot"),'effectif.nb12','effectif.nb15','effectif.nb16','effectif.nb18','effectif.nb05','matiere.libmat','matiere.codemat','matiere.nbh','etab.codeetab as id','etab.libetab','classe.nbclasse')

       ->distinct()



       ->get();

select distinct `matiere`.`libmat`, `matiere`.`codemat` from `matiere`
---
    public function getmat(){
        $data = DB::table('matiere')
        ->select( 'matiere.libmat','matiere.codemat')
        ->distinct()

        ->get();