app/Http/Controllers/PiloteController.php

select `etab`.`codeetab` as `id`, `etab`.`libetab` from `etab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation` where `etab`.`typeetab` = '40' or `etab`.`typeetab` = '50'
---
    public function index()
    {

        $data = DB::table('etab')
       ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
       ->join('delegation', 'delegation.code', '=', 'etab.delegation')

       ->select('etab.codeetab as id','etab.libetab' )
       ->where('etab.typeetab','=','40')
       ->Orwhere('etab.typeetab','=','50')

       ->get();