app/Http/Controllers/PiloteLcController.php

    public function index()
    {

        $data = DB::table('etab')
       ->join('typeetab', 'typeetab.codetype', '=', 'etab.typeetab')
       ->join('delegation', 'delegation.code', '=', 'etab.delegation')

       ->select('etab.codeetab as id','etab.libetab' )
       //->where('etab.typeetab','=','40')
       ->where('etab.typeetab','=','30')

       ->get();
---
select `etab`.`codeetab` as `id`, `etab`.`libetab` from `etab` inner join `typeetab` on `typeetab`.`codetype` = `etab`.`typeetab` inner join `delegation` on `delegation`.`code` = `etab`.`delegation` where `etab`.`typeetab` = '30'