app/Http/Controllers/QovexController.php

    public function getens(Request $request)
    {
       $data = Enseignant::where('sexe','=','ذكر')
    ->count();
    /* $data = DB::table('Enseignant')
    ->where('id', '=','17')
    ->select('sexe' )
    ->get(); */
    $data2 = Enseignant::where('sexe','=','أنثى')
    ->count();
---
select count(*) as aggregate from `enseignant` where `sexe` = 'ذكر'
select count(*) as aggregate from `enseignant` where `sexe` = 'أنثى'

    public function indexbesoin(Request $request)
    {
        $data = User::where('role','=','user')
    ->count();
---
select count(*) as aggregate from `users` where `role` = 'user'